app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("last_login_at", "email", "last_login_ip", "initials", "name", "login", "crypted_password", "persistence_token", "updated_at", "failed_login_count", "last_request_at", "login_count", "current_login_at", "current_login_ip", "created_at") VALUES (NULL, 'wookimiii@gmail.com', NULL, 'H', 'Andrew', 'akim', '985ddf647c01415ee07e9df946cefd92a7b489cf4dd759a846a14476a8df6618e07de930860c6aa0da579e7658bd9ab606d0da2d83e49c3d8ed057f427da3351', '8037c0ab9851f658be231e9d8990c9306659c09806c3581324d018334f9c562ab4e9e3ce922d0e93d6d65033cd56d84adcd6f0b76bb9023d71a7306a06c56a0e', '2010-12-17 21:22:01.152932', 0, '2010-12-17 21:22:01.152493', 1, '2010-12-17 21:22:01.152335', '127.0.0.1', '2010-12-17 21:22:01.152932')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT "users".* FROM "users" WHERE ("users"."id" = 21) LIMIT 1
UPDATE "users" SET "last_login_ip" = '127.0.0.1', "updated_at" = '2010-12-17 21:57:50.389137', "login_count" = 2, "persistence_token" = 'd9474ee9e8a14229274df001574997c431603bc0d822957bcdaeceb5aaa969ae829d6486addbd18b9981ba84d6a3ee7c810d7102512409413d6f1747480ad47c', "current_login_at" = '2010-12-17 21:57:50.388183', "last_login_at" = '2010-12-17 21:22:01.152335', "login" = 'wookim', "last_request_at" = '2010-12-17 21:57:50.388561' WHERE ("users"."id" = 21)
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 2)
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy